// // Задача 1: Експорт та імпорт функцій
// // Опис:
// // Створи файл mathOperations.js, в якому буде кілька функцій, таких як додавання, віднімання,
// // множення та ділення чисел. Твоє завдання — експортувати ці функції з файлу, щоб вони могли
// // бути доступними для інших файлів. Далі, створи файл import-export.js, де ти імпортуєш ці
// // функції з файлу mathOperations.js та використаєш їх для виконання математичних операцій з числами.
// // Ціль:
// // Навчитися експортувати та імпортувати кілька функцій з одного модуля в інший, а також
// // використовувати імпортовані функції в новому контексті.

// import {
//   add,
//   subtract,
//   multiply,
//   divide,
// } from "./import-export/mathOperations.js";

// // console.log(add(3, 5));
// // console.log(divide(0, 3));

// Задача 2: Експорт об'єктів та імпорт під іншою назвою
// Опис:
// Створи файл user.js, в якому оголоси об'єкт user, що містить інформацію про користувача
// (наприклад, ім'я, вік та email). Експортуй цей об'єкт, щоб він міг бути використаний в
// інших файлах. У файлі import-export.js імпортуй цей об'єкт, але при цьому зміни його
// назву на іншу, скажімо, person. Після цього використай імпортований об'єкт для виведення
// інформації про користувача на консоль або для іншої маніпуляції з його даними.
// Ціль:
// Вивчити, як експортувати об'єкти та імпортувати їх під іншими іменами, що корисно для
// уникнення конфліктів імен або для полегшення читабельності коду.

import { user as person } from "./import-export/users.js";

// console.log(person.email);


/*3

import log from "./import-export/logger.js";
log('Bonjour log')

import { Person } from "./import-export/person.js";
const artur = new Person('Artur', '27');
console.log(artur.introduce());*/
